configuration/src/Catalogs/EmailProcessingRules/EmailProcessingRules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>EmailProcessingRules</name>
  <owners>Catalog.EmailAccounts</owners>
  <attributes>
    <name>SettingsComposer</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>PutInFolder</name>
    <type>
      <types>CatalogRef.EmailMessageFolders</types>
    </type>
  </attributes>
  <attributes>
    <name>AddlOrderingAttribute</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FilterPresentation</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/InformationRegisters/InteractionsFolderSubjects/InteractionsFolderSubjects.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>InteractionsFolderSubjects</name>
  <resources>
    <name>SubjectOf</name>
    <type>
      <types>DefinedType.InteractionSubject</types>
    </type>
  </resources>
  <resources>
    <name>EmailMessageFolder</name>
    <type>
      <types>CatalogRef.EmailMessageFolders</types>
    </type>
  </resources>
  <resources>
    <name>Reviewed</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ReviewAfter</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Interaction</name>
    <type>
      <types>DocumentRef.OutgoingEmail</types>
      <types>DocumentRef.PlannedInteraction</types>
      <types>DocumentRef.IncomingEmail</types>
      <types>DocumentRef.PhoneCall</types>
      <types>DocumentRef.Meeting</types>
      <types>DocumentRef.SMSMessage</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Documents/IncomingEmail/IncomingEmail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>IncomingEmail</name>
  <posting>Deny</posting>
  <attributes>
    <name>Importance</name>
    <type>
      <types>EnumRef.InteractionImportanceOptions</types>
    </type>
  </attributes>
  <attributes>
    <name>InternalTitle</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DateReceived</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>HasAttachments</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IDAtServer</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BasisID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MessageID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BasisIDs</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Encoding</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EmployeeResponsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>SenderAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SenderContact</name>
    <type>
      <types>DefinedType.InteractionContact</types>
    </type>
  </attributes>
  <attributes>
    <name>SenderPresentation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Size</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CcRecipientsList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EmailRecipientsList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Text</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>HTMLText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TextType</name>
    <type>
      <types>EnumRef.EmailTextTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Account</name>
    <type>
      <types>CatalogRef.EmailAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>InteractionBasis</name>
    <type>
      <types>DocumentRef.OutgoingEmail</types>
      <types>DocumentRef.IncomingEmail</types>
    </type>
  </attributes>
  <attributes>
    <name>RequestDeliveryReceipt</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RequestReadReceipt</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>HashSum</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>EmailRecipients</name>
    <attributes>
      <name>Address</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Contact</name>
      <type>
        <types>DefinedType.InteractionContact</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CCRecipients</name>
    <attributes>
      <name>Address</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Contact</name>
      <type>
        <types>DefinedType.InteractionContact</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ReplyRecipients</name>
    <attributes>
      <name>Address</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Contact</name>
      <type>
        <types>DefinedType.InteractionContact</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessValuesSets</name>
    <attributes>
      <name>SetNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AccessValue</name>
      <comment>Empty values must be allowed to avoid errors when writing objects to be checked</comment>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>Refinement</name>
      <type>
        <types>CatalogRef.MetadataObjectIDs</types>
      </type>
    </attributes>
    <attributes>
      <name>Read</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Update</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ReadReceiptAddresses</name>
    <attributes>
      <name>Address</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Contact</name>
      <type>
        <types>DefinedType.InteractionContact</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PendingAttachments</name>
    <attributes>
      <name>NameAttachment</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/Catalogs/EmailProcessingRules/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region ForCallsFromOtherSubsystems

// StandardSubsystems.BatchEditObjects

// Returns the object attributes that are not recommended to be edited
// using a bulk attribute modification data processor.
//
// Returns:
//  Array of String
//
Function AttributesToSkipInBatchProcessing() Export
	
	Result = New Array;
	Result.Add("Code");
	Result.Add("Description");
	Result.Add("SettingsComposer");
	Result.Add("PutInFolder");
	Result.Add("AddlOrderingAttribute");
	Result.Add("FilterPresentation");
	Return Result;
	
EndFunction

// End StandardSubsystems.BatchEditObjects

// StandardSubsystems.AccessManagement

// Parameters:
//   Restriction - See AccessManagementOverridable.OnFillAccessRestriction.Restriction.
//
Procedure OnFillAccessRestriction(Restriction) Export
	
	Restriction.Text =
	"AllowReadUpdate
	|WHERE
	|	ValueAllowed(Owner)
	|	OR ValueAllowed(Owner.AccountOwner, EmptyRef AS FALSE)";
	
EndProcedure

// End StandardSubsystems.AccessManagement

#EndRegion

#EndRegion

#Region Internal

// Applies email processing rules.
//
// Parameters:
//  ExportingParameters  - Structure:
//    * ForEmailsInFolder     - CatalogRef.EmailMessageFolders - mail messages in this folder will be processed.
//    * IncludingSubordinates - Boolean - shows that emails in subordinate folders must be processed.
//    * RulesTable      - ValueTable - a table of rules that must be applied.
//  StorageAddress - String - a message about the rule application result.
//
Procedure ApplyRules(ExportingParameters, StorageAddress) Export
	
	Query = New Query(
		"SELECT
		|	SelectedRules.Rule,
		|	SelectedRules.Apply
		|INTO SelectedRules
		|FROM
		|	&SelectedRules AS SelectedRules
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	SelectedRules.Rule AS Ref,
		|	EmailProcessingRules.Owner AS Account,
		|	EmailProcessingRules.Description AS RuleDescription,
		|	EmailProcessingRules.SettingsComposer,
		|	EmailProcessingRules.PutInFolder
		|FROM
		|	SelectedRules AS SelectedRules
		|		INNER JOIN Catalog.EmailProcessingRules AS EmailProcessingRules
		|		ON SelectedRules.Rule = EmailProcessingRules.Ref
		|WHERE
		|	SelectedRules.Apply
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT DISTINCT
		|	IncomingEmail.Ref,
		|	InteractionsFolderSubjects.EmailMessageFolder AS Folder
		|FROM
		|	Document.IncomingEmail AS IncomingEmail
		|		LEFT JOIN InformationRegister.InteractionsFolderSubjects AS InteractionsFolderSubjects
		|		ON InteractionsFolderSubjects.Interaction = IncomingEmail.Ref
		|WHERE
		|	&ConditionByFolder
		|
		|UNION ALL
		|
		|SELECT
		|	OutgoingEmail.Ref,
		|	InteractionsFolderSubjects.EmailMessageFolder
		|FROM
		|	Document.OutgoingEmail AS OutgoingEmail
		|		LEFT JOIN InformationRegister.InteractionsFolderSubjects AS InteractionsFolderSubjects
		|		ON InteractionsFolderSubjects.Interaction = OutgoingEmail.Ref
		|WHERE
		|	&ConditionByFolder");
	
	Query.Text = StrReplace(Query.Text, "&ConditionByFolder", 
		?(ExportingParameters.IncludingSubordinates, 
			"InteractionsFolderSubjects.EmailMessageFolder IN HIERARCHY(&EmailMessageFolder)", 
			"InteractionsFolderSubjects.EmailMessageFolder = &EmailMessageFolder"));
	Query.SetParameter("SelectedRules", ExportingParameters.RulesTable);
	Query.SetParameter("EmailMessageFolder", ExportingParameters.ForEmailsInFolder);
	
	Result = Query.ExecuteBatch();
	If Result[2].IsEmpty() Then
		MessageText = NStr("en = 'The selected folder is empty.';");
		PutToTempStorage(MessageText, StorageAddress);
		Return;
	EndIf;
	
	EmailsTable = Result[2].Unload();
	EmailMessagesToProcess = EmailsTable.UnloadColumn("Ref");
	FoldersToProcess = EmailsTable.UnloadColumn("Folder");
	FoldersToProcess = CommonClientServer.CollapseArray(FoldersToProcess);
	
	MailFolders = New ValueTable;
	MailFolders.Columns.Add("Folder");
	MailFolders.Columns.Add("MailMessage");
	
	SelectedRule = Result[1].Select();
	While SelectedRule.Next() Do
		
		Try
			ProcessingRulesSchema = GetTemplate("EmailProcessingRuleScheme");
			
			TemplateComposer = New DataCompositionTemplateComposer();
			SettingsComposer = New DataCompositionSettingsComposer;
			SettingsComposer.Initialize(New DataCompositionAvailableSettingsSource(ProcessingRulesSchema));
			SettingsComposer.LoadSettings(SelectedRule.SettingsComposer.Get());
			SettingsComposer.Refresh(DataCompositionSettingsRefreshMethod.CheckAvailability);
			CommonClientServer.SetFilterItem(SettingsComposer.Settings.Filter,
				"Ref", EmailMessagesToProcess, DataCompositionComparisonType.InList);
			CommonClientServer.SetFilterItem(SettingsComposer.Settings.Filter,
				"Ref.Account", ExportingParameters.Account, DataCompositionComparisonType.Equal);
			
			DataCompositionTemplate = TemplateComposer.Execute(ProcessingRulesSchema,
				SettingsComposer.GetSettings(),,, Type("DataCompositionValueCollectionTemplateGenerator"));
			
			QueryText = DataCompositionTemplate.DataSets.MainDataSet.Query;
			QueryRule = New Query(QueryText);
			For Each Parameter In DataCompositionTemplate.ParameterValues Do
				QueryRule.Parameters.Insert(Parameter.Name, Parameter.Value);
			EndDo;
			
			// 
			EmailResult = QueryRule.Execute();
		
		Except
			
			ErrorMessageTemplate = NStr("en = 'Cannot apply the ""%1"" mailbox rule to the ""%2"" account due to: 
			                                |%3
			                                |Correct the mailbox rule.';", Common.DefaultLanguageCode());
		
			ErrorMessageText = StringFunctionsClientServer.SubstituteParametersToString(
				ErrorMessageTemplate, 
				SelectedRule.RuleDescription,
				SelectedRule.Account,
				ErrorProcessing.DetailErrorDescription(ErrorInfo()));
			WriteLogEvent(EmailManagement.EventLogEvent(), 
				EventLogLevel.Error, , SelectedRule.Ref, ErrorMessageText);
			Continue;
			
		EndTry;
		
		If Not EmailResult.IsEmpty() Then
			SelectedEmailMessage = EmailResult.Select();
			While SelectedEmailMessage.Next() Do
				
				NewTableRow = MailFolders.Add();
				NewTableRow.Folder = SelectedRule.PutInFolder;
				NewTableRow.MailMessage = SelectedEmailMessage.Ref;
				
				IndexOf = EmailMessagesToProcess.Find(SelectedEmailMessage.Ref);
				If IndexOf <> Undefined Then
					EmailMessagesToProcess.Delete(IndexOf);
				EndIf;
			EndDo;
		EndIf;
		
	EndDo;
	
	Interactions.SetEmailFolders(MailFolders, False);
	CommonClientServer.SupplementArray(FoldersToProcess, MailFolders.UnloadColumn("Folder"), True);
	Interactions.CalculateReviewedByFolders(Interactions.TableOfDataForReviewedCalculation(FoldersToProcess, "Folder"));
	
	If MailFolders.Count() > 0 Then
		MessageText = NStr("en = 'All messages are moved to the folders.';");
	Else
		MessageText =  NStr("en = 'No messages were moved.';");
	EndIf;
	
	PutToTempStorage(MessageText, StorageAddress);
	
EndProcedure

#EndRegion

#EndIf
